app/Controllers/Dashboard.php

SELECT *
FROM `categories`
---
    public function categories(){
      $model = new CategoryModel();
      $data = $model->findAll(); // Retrieve all categories

SELECT `product`.*, `categories`.`categories` as `category_name`
FROM `product`
JOIN `categories` ON `product`.`categories_id` = `categories`.`id`
---
    public function product(){
      $model = new ProductModel();
      $data = $model
        ->select('product.*, categories.categories as category_name')
        ->join('categories', 'product.categories_id = categories.id')
        ->findAll();

SELECT *
FROM `categories`
SELECT *
FROM `product`
WHERE `categories_id` = '4'
AND `name` = 'Cloth 6'
 LIMIT 1
---
    public function addproduct()
    {
        $categoryModel = new CategoryModel();
        $data = $categoryModel->findAll();
        $fileerror = "";
        $error = " ";

        if ($this->request->getMethod() === 'post') {
            // Handle form submission
            $productModel = new ProductModel();

            $productData = [
                'categories_id' => $this->request->getPost('categories_id'),
                'name' => $this->request->getPost('name'),
                'mrp' => $this->request->getPost('mrp'),
                'price' => $this->request->getPost('price'),
                'qty' => $this->request->getPost('qty'),
                'short_desc' => $this->request->getPost('short_desc'),
                'description' => $this->request->getPost('description'),
                'meta_title' => $this->request->getPost('meta_title'),
                'meta_desc' => $this->request->getPost('meta_desc'),
                'meta_keyword' => $this->request->getPost('meta_keyword'),
            ];

            // Check if a product with the same name already exists in the selected category
            $existingProduct = $productModel->where('categories_id', $productData['categories_id'])
                ->where('name', $productData['name'])
                ->first();

SELECT *
FROM `users`
---
    public function users(){
      $model = new UsersModel();
      $data = $model->findAll(); // Retrieve all users

SELECT *
FROM `users`
---
    public function contactus(){
      $model = new UsersModel();
      $data = $model->findAll(); // Retrieve all users